tap "1password/tap"
tap "atlassian/acli"
tap "homebrew/command-not-found"
tap "nikitabobko/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Extract files from Microsoft cabinet files
brew "cabextract"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox@developer-edition"
cask "font-symbols-only-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility to extend trackpad functionality
cask "middleclick"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Customizable timing of breaks
cask "time-out"
# Virtual machines UI using QEMU
cask "utm"
# Rust-based terminal
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "Air Printer", id: 929399895
mas "Bitwarden", id: 1352778147
mas "Brother iPrint&Scan", id: 1193539993
mas "Clocker", id: 1056643111
mas "CrystalFetch", id: 6454431289
mas "EmojiFinder", id: 1457744893
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "mymind", id: 1532801185
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "augment.vscode-augment"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "rooveterinaryinc.roo-cline"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
